====
Empty
====

---
(program)

====
Comment
====

// Parse as a comment: `process = +(1);`
/**
Everything in here should parse as a comment:
```
    declare complex_string "a\"\n\r!@#$%^&*(),<.>?/~`{}\|\';:";
    process = +(1);
```
*/

var = 1; // Comment at the end of a line.
process = var; /* Comment at the end of a line. */

// Bye! /*still in line comment...*/ // still in line comment...
---
(program
  (comment)
  (comment)
  (definition (id) (int))
  (comment)
  (definition (id) (id))
  (comment)
  (comment))

====
Namespaced variable assignment
====

process = ::foo::bar::baz;

---
(program
  (definition (id) (id)))

====
Function definition
====

identity(var) = var;
identity ( var ) = var ;

---
(program
  (function_definition (id) (parameters (parameter)) (id))
  (function_definition (id) (parameters (parameter)) (id)))

====
Metadata
====

declare name "Noise";
declare complex_string "a\"\n\r!@#$%^&*(),<.>?/~`{}\|\';:";

declare add author "Karl Hiner";
add = +;

---
(program
  (global_metadata key: (id) value: (string))
  (global_metadata key: (id) value: (string))
  (function_metadata function_name: (id) key: (id) value: (string))
  (definition name: (id) value: (add)))

====
Import
====

import("stdfaust.lib");
import ( "stdfaust.lib" ) ;
---
(program
  (file_import (string))
  (file_import (string)))

====
Single variant
====

singleprecision int_part(idv) = idv : _,!;

---
(program
  (variant)
  (function_definition (id)
    (parameters (parameter))
    (sequential (id) (parallel (wire) (cut)))))

====
Two variants
====

doubleprecision quadprecision int_part(idv) = int(idv);

---
(program
  (variant)
  (variant)
  (function_definition (id)
    (parameters (parameter))
    (prim1 (int_cast) (id))))

====
Memory
====

// These are semantically equivalent.
var1 = mem;
var2 = @(var1);
process = var2';

---
(program
  (comment)
  (definition (id) (mem))
  (definition (id) (partial (delay) (id)))
  (definition (id) (modifier (id) (one_sample_delay))))

===
Component
===

process = component("karplus32.dsp") : component("freeverb.dsp");

---
(program
  (definition (id)
    (sequential (component (string)) (component (string)))))

===
Explicit substitution
===

process = component("freeverb.dsp")[foo(x) = 1; bar = _;];

---
(program
  (definition
    name: (id)
    value: (substitution
      expression: (component (string))
      (substitutions
        (function_definition name: (id) (parameters (parameter)) value: (int))
        (definition name: (id) value: (wire))))))
