=====
Recursive
=====
process = _~+(1);
---
(source_file
  (definition
    (simple_definition
      name: (variable (identifier))
      value: (expression
        (binary_composition
          (recursive
            left: (expression
              (identity_function))
            right: (expression
              (binary_operation
                (partial
                  (binary_operator)
                  (object
                    (number
                      (int))))))))))))
=====
Sequential
=====
a=_:_;
---
(source_file
  (definition
    (simple_definition
      name: (variable (identifier))
      value: (expression
        (binary_composition
          (sequential
            left: (expression
              (identity_function))
            right: (expression
              (identity_function))))))))

=====
Split two
=====
a=_<:_,_;
---
(source_file
  (definition
    (simple_definition
      name: (variable (identifier))
      value: (expression
        (binary_composition
          (split
            left: (expression
              (identity_function ))
            right: (expression
              (identity_function ))
            right: (expression
              (identity_function ))))))))
=====
Split three
=====
a=_<:_,_,_;
---
(source_file
  (definition
    (simple_definition
      name: (variable (identifier))
      value: (expression
        (binary_composition
          (split
            left: (expression
              (identity_function ))
            right: (expression
              (identity_function ))
            right: (expression
              (binary_composition
                (parallel
                  (expression
                    (identity_function ))
                  (expression
                    (identity_function )))))))))))
=====
Merge two
=====
a=_,_:>_;
---
(source_file
  (definition
    (simple_definition
      name: (variable (identifier))
      value: (expression
        (binary_composition
          (merge
            left: (expression
              (identity_function ))
            left: (expression
              (identity_function ))
            right: (expression
              (identity_function ))))))))
=====
Merge three
=====
a=_,_,_:>_;
---
(source_file
  (definition
    (simple_definition
      name: (variable (identifier))
      value: (expression
        (binary_composition
          (parallel
            (expression
              (identity_function ))
            (expression
              (binary_composition
                (merge
                  left: (expression
                    (identity_function ))
                  left: (expression
                    (identity_function ))
                  right: (expression
                    (identity_function )))))))))))
